<a href="https://colab.research.google.com/github/uervitonsantos/Notebook-Analise-De-Dados-Python/blob/main/nlp_nltk.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [30]:
import pandas as pd #manipulacao dataframe

In [31]:
import string #manipulacao de string
import numpy as np #algebra
#visualização
from matplotlib import pyplot as plt #grafico
import seaborn as sns
from PIL import Image
from wordcloud import WordCloud, ImageColorGenerator

#pre processamento
import nltk
nltk.download('punkt')
from nltk.tokenize import word_tokenize
from nltk.tokenize import sent_tokenize
from nltk.corpus import words 
from nltk.corpus import stopwords #preprocessamento
from nltk.tokenize import word_tokenize #preprocessamento
from textblob import TextBlob #analise sentimento

[nltk_data] Downloading package punkt to /root/nltk_data...
[nltk_data]   Package punkt is already up-to-date!

In [32]:
df = pd.read_csv('train.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [33]:
df.shape

(891, 12)

In [34]:
# display columns
print ("Colunas Originais ")
df.columns

Colunas Originais

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [35]:
# dropping columns
tweet = df.copy()

In [36]:
tweet.drop(['PassengerId', 'Survived', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],axis=1, inplace = True)
tweet.head(10)

   Pclass                                               Name
0       3                            Braund, Mr. Owen Harris
1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2       3                             Heikkinen, Miss. Laina
3       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4       3                           Allen, Mr. William Henry
5       3                                   Moran, Mr. James
6       1                            McCarthy, Mr. Timothy J
7       3                     Palsson, Master. Gosta Leonard
8       3  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9       2                Nasser, Mrs. Nicholas (Adele Achem)

In [ ]:
# filtrando os dados com 'language = pt'
#tweet = tweet[(tweet.last.language == "pt")].reset_index(drop = True)
# check valores missing
tweet.isna().sum()

In [37]:
tweet.drop(['Pclass'], axis = 1, inplace = True)
tweet.head()

                                                Name
0                            Braund, Mr. Owen Harris
1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2                             Heikkinen, Miss. Laina
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                           Allen, Mr. William Henry

In [38]:
# check valores missing
tweet.isna().sum()

Name    0
dtype: int64

In [39]:
 #shape
tweet.shape

(891, 1)

In [40]:
pd.DataFrame.info(tweet);

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    891 non-null    object
dtypes: object(1)
memory usage: 7.1+ KB

In [44]:
def show_wordcloud(data , title = None):
    wordcloud = WordCloud(background_color = 'black', max_words = 2, max_font_size =2).generate(str(data))
    fig = plt.figure(1, figsize=(4, 4))
    plt.axis('off')
    plt.title(title, size = 2)
    plt.imshow(wordcloud, interpolation='bilinear')
    plt.show()

    show_wordcloud(tweet['Name'])